Reports/бит_СозданныеИсковыеИСудебныеПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_СозданныеИсковыеИСудебныеПриказы</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБухгалтерскиеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бит_Паспортист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бит_РуководительРасчетнойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бит_Специалист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаОформление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ИсковоеЗаявление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ИсковоеЗаявление</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЮридическихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйУчасток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абзац</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеСуда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправленВСуд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсковоеЗаявление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричинаОтмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Печать</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/бит_СозданныеИсковыеИСудебныеПриказы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// Процедура формирует отчет.
// 
// Параметры: 
// 		ТабДок - ЭлементыФормы - Результат отчета.
//
Процедура ОтчетВывести(ТабДок, Период, Услуга, Отбор, Здание) Экспорт 
	
	ТабДок.Очистить();
	
	ДатаНачала = Период.ДатаНачала; 
	ДатаОкончания = Период.ДатаОкончания;
	ЕстьОтборПоЗданию = ЗначениеЗаполнено(Здание);
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ТабДок.РазмерСтраницы = "A4";
	ТабДок.АвтоМасштаб  = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ИсковоеЗаявление.Ссылка КАК Ссылка,
		|	бит_ИсковоеЗаявление.Услуга КАК Услуга,
		|	бит_ИсковоеЗаявление.Адрес КАК Адрес,
		|	бит_ИсковоеЗаявление.СуммаЗадолженности КАК СуммаЗадолженности,
		|	бит_ИсковоеЗаявление.Госпошлина КАК Госпошлина,
		|	бит_ИсковоеЗаявление.Здание КАК Здание,
		|	бит_ИсковоеЗаявление.Здание.Участок.Владелец.Наименование КАК ЗданиеУчастокВладелец,
		|	бит_ИсковоеЗаявление.ПредставительскиеРасходы КАК ПредставительскиеРасходы,
        // KAN +++
		|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
		|	бит_ИсковоеЗаявление.Квартира КАК Квартира,
        // KAN ---
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры
		|ПОМЕСТИТЬ ВТ_Доки
		|ИЗ
		|	Документ.бит_ИсковоеЗаявление КАК бит_ИсковоеЗаявление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_ИсковоеЗаявление.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|ГДЕ
		|	бит_ИсковоеЗаявление.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И бит_ИсковоеЗаявление.Проведен
		|	И бит_ИсковоеЗаявление.Услуга В(&Услуга)
		|	И ВЫБОР Когда &ЕстьОтборПоЗданию 
		|			Тогда бит_ИсковоеЗаявление.Здание = &Здание
		|			Иначе Истина
		|		Конец
		|	И ВЫБОР
		|			КОГДА &Отбор = 1
		|				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.НежилоеПомещение)
		|			КОГДА &Отбор = 2
		|				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_ИсковоеЗаявлениеОтветчики.Ссылка КАК Ссылка,
		|	бит_ИсковоеЗаявлениеОтветчики.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТ_Ответчики
		|ИЗ
		|	Документ.бит_ИсковоеЗаявление.Ответчики КАК бит_ИсковоеЗаявлениеОтветчики
		|ГДЕ
		|	бит_ИсковоеЗаявлениеОтветчики.Ссылка В
		|			(ВЫБРАТЬ
		|				Вт_Доки.Ссылка КАК изВТ_Доки
		|			ИЗ
		|				Вт_Доки)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК РС_ЛВБ,
		|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк_ЛВБ,
		|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК_ЛВБ,
		|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет_ЛВБ
		|ПОМЕСТИТЬ ВТ_Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИНН = ""5503245214""
		|	И Организации.КПП = ""550301001""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ОрганизацииКонтактнаяИнформация.Вид КАК Вид,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Адрес_ЛВБ
		|ПОМЕСТИТЬ ВТ_АдресЛВБ
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Организация.Ссылка
		|			ИЗ
		|				ВТ_Организация)
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.ФИО КАК Контакт_ЛВБ,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК Должность_ЛВБ
		|ПОМЕСТИТЬ ВТ_ОтветЛицаЛВБ
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|			&ДатаОкончания,
		|			СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						Вт_Организация.Ссылка
		|					ИЗ
		|						Вт_Организация)
		|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК РС_КомСети,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк_КомСети,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК_КомСети,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет_КомСети,
		|	Контрагенты.ОсновноеКонтактноеЛицо.Наименование КАК Контакт_КомСети,
		|	Контрагенты.ОсновноеКонтактноеЛицо.Должность КАК Должность_КомСети
		|ПОМЕСТИТЬ ВТ_Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = ""5503105129""
		|	И Контрагенты.КПП = ""550301001""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтрагентыКонтактнаяИнформация.Вид КАК Вид,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Адрес_КомСети
		|ПОМЕСТИТЬ ВТ_АдресКонтрагент
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Вт_Контрагент.Ссылка
		|			ИЗ
		|				Вт_Контрагент)
		|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Доки.Ссылка КАК Ссылка,
		|	ВТ_Доки.Услуга КАК Услуга,
		|	ВТ_Доки.ЗданиеУчастокВладелец КАК Участок,
		|	ВТ_Доки.Адрес КАК Адрес,
        // KAN +++
		|	ВТ_Доки.Здание КАК Здание,
		|	ВТ_Доки.Квартира.бит_НомерКвартирыДляСортировки КАК Квартира,
		|	ВТ_Доки.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
		| 	ВТ_Доки.Здание.Улица.Наименование КАК ЗданиеУлицаНаименование,
		|	ВТ_Доки.Здание.НомерДома КАК ЗданиеНомерДома,
       // KAN ---
		|	ВТ_Доки.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ВТ_Доки.Госпошлина КАК Госпошлина,
		|	ВТ_Доки.ПредставительскиеРасходы КАК ПредставительскиеРасходы
		|ИЗ
		|	ВТ_Доки КАК ВТ_Доки
		|
        // KAN +++
		|УПОРЯДОЧИТЬ ПО
		|	ЗданиеУлицаНаименование,
		|	ЗданиеНомерДома,
		|	Здание,
		|	Квартира
        // KAN ---
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Ответчики.Ссылка КАК Ссылка,
		|	ВТ_Ответчики.ФизЛицо КАК ФизЛицо,
		|	ВЫБОР
		|		КОГДА ФИОФизическихЛицСрезПоследних.Фамилия ЕСТЬ NULL
		|			ТОГДА ВТ_Ответчики.ФизЛицо
		|		ИНАЧЕ ФИОФизическихЛицСрезПоследних.Фамилия + "" "" + ФИОФизическихЛицСрезПоследних.Имя + "" "" + ФИОФизическихЛицСрезПоследних.Отчество
		|	КОНЕЦ КАК ФИО
		|ИЗ
		|	ВТ_Ответчики КАК ВТ_Ответчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						ВТ_Ответчики.ФизЛицо
		|					ИЗ
		|						ВТ_Ответчики)) КАК ФИОФизическихЛицСрезПоследних
		|		ПО ВТ_Ответчики.ФизЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Организация.Ссылка КАК Ссылка,
		|	ВТ_Организация.РС_ЛВБ КАК РС_ЛВБ,
		|	ВТ_Организация.Банк_ЛВБ КАК Банк_ЛВБ,
		|	ВТ_Организация.БИК_ЛВБ КАК БИК_ЛВБ,
		|	ВТ_Организация.КоррСчет_ЛВБ КАК КоррСчет_ЛВБ,
		|	ВТ_АдресЛВБ.Адрес_ЛВБ КАК Адрес_ЛВБ,
		|	ВТ_ОтветЛицаЛВБ.Контакт_ЛВБ КАК Контакт_ЛВБ,
		|	ВТ_ОтветЛицаЛВБ.Должность_ЛВБ КАК Должность_ЛВБ
		|ИЗ
		|	ВТ_Организация КАК ВТ_Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АдресЛВБ КАК ВТ_АдресЛВБ
		|		ПО ВТ_Организация.Ссылка = ВТ_АдресЛВБ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветЛицаЛВБ КАК ВТ_ОтветЛицаЛВБ
		|		ПО ВТ_Организация.Ссылка = ВТ_ОтветЛицаЛВБ.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контрагент.Ссылка КАК Ссылка,
		|	ВТ_Контрагент.РС_КомСети КАК РС_КомСети,
		|	ВТ_Контрагент.Банк_КомСети КАК Банк_КомСети,
		|	ВТ_Контрагент.БИК_КомСети КАК БИК_КомСети,
		|	ВТ_Контрагент.КоррСчет_КомСети КАК КоррСчет_КомСети,
		|	ВТ_Контрагент.Контакт_КомСети КАК Контакт_КомСети,
		|	ВТ_Контрагент.Должность_КомСети КАК Должность_КомСети,
		|	ВТ_АдресКонтрагент.Адрес_КомСети КАК Адрес_КомСети
		|ИЗ
		|	ВТ_Контрагент КАК ВТ_Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АдресКонтрагент КАК ВТ_АдресКонтрагент
		|		ПО ВТ_Контрагент.Ссылка = ВТ_АдресКонтрагент.Ссылка";
	                                            	
	Запрос.УстановитьПараметр("ДатаНачала"			, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		, ДатаОкончания);
	Запрос.УстановитьПараметр("Услуга"				, Услуга); 
	Запрос.УстановитьПараметр("Отбор"           	, Отбор);   
	//Melnik 15601
	Запрос.УстановитьПараметр("ЕстьОтборПоЗданию"	, ЕстьОтборПоЗданию); 
	Запрос.УстановитьПараметр("Здание"           	, Здание);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ДатаНачала = Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДатаОкончания = Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
	
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьЗаголовокСтрок = Макет.ПолучитьОбласть("ЗаголовокСтрок");
	ТабДок.Вывести(ОбластьЗаголовокСтрок);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ВыборкаДокументы = МассивРезультатов[7].Выбрать();
	ТЗ_Ответчики = МассивРезультатов[8].Выгрузить();
	
	НомерСтроки = 1;
	СтруктураОтбора = Новый Структура("Ссылка");
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ФИО = "";
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры ,ВыборкаДокументы);
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;

        // KAN +++
		СтруктураПоиска = Новый Структура("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания"));
		
		Строки = ВыборкаДокументы.Здание.КонтактнаяИнформация.НайтиСтроки(СтруктураПоиска);
		
		Если Строки.количество() = 0 и ЗначениеЗаполнено(ВыборкаДокументы.Здание.ПочтовыйАдрес) И ЗначениеЗаполнено(ВыборкаДокументы.лб_ПредставлениеКвартиры) Тогда
			
			Адрес = ВыборкаДокументы.Здание.ПочтовыйАдрес + " кв." + Строка(ВыборкаДокументы.лб_ПредставлениеКвартиры);
			
		ИначеЕсли НЕ Строки.количество() = 0 И ЗначениеЗаполнено(ВыборкаДокументы.лб_ПредставлениеКвартиры) Тогда	
			
			Адрес = Строки[0].Представление + " кв." + Строка(ВыборкаДокументы.лб_ПредставлениеКвартиры);
		
		Иначе
			
			Адрес = ВыборкаДокументы.Адрес;
			
		КонецЕсли;		
		ОбластьСтрока.Параметры.Адрес = Адрес;
        // KAN ---
		
		СтруктураОтбора.Ссылка = ВыборкаДокументы.Ссылка;
		мОтветчики = ТЗ_Ответчики.НайтиСтроки(СтруктураОтбора);
		
		Если мОтветчики.Количество() Тогда
			
			Для Каждого СтрМ Из мОтветчики Цикл
				ФИО = ФИО + СтрМ.ФИО + "," + Символы.ПС ;
			КонецЦикла;
			
		КонецЕсли;
		
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ФИО, 2);
				
		ОбластьСтрока.Параметры.ФИО = ФИО;
		
		ТабДок.Вывести(ОбластьСтрока);
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаПодвалЛВБ = МассивРезультатов[9].Выбрать();
	
	Если ВыборкаПодвалЛВБ.Количество() Тогда  
		
		ВыборкаПодвалЛВБ.Следующий();
		
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаПодвалЛВБ);
		ОбластьПодвал.Параметры.Контакт_ЛВБ = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(ВыборкаПодвалЛВБ.Контакт_ЛВБ);

	КонецЕсли;
	
	ВыборкаПодвалКонтрагент = МассивРезультатов[10].Выбрать();
	
	Если ВыборкаПодвалКонтрагент.Количество() Тогда
		
		ВыборкаПодвалКонтрагент.Следующий();
		
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаПодвалКонтрагент);
		
		Если ЗначениеЗаполнено(ВыборкаПодвалКонтрагент.Контакт_КомСети) Тогда
			ОбластьПодвал.Параметры.Контакт_КомСети = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(ВыборкаПодвалКонтрагент.Контакт_КомСети);
		КонецЕсли;
		
	
	КонецЕсли;
		
	ТабДок.Вывести(ОбластьПодвал);
	 
КонецПроцедуры


Процедура ОтчетВывестиВТЗ(ТЗ, Период, Услуга, Отбор, Здание) Экспорт 
	
	ТЗ.Очистить();
	
	ДатаНачала = Период.ДатаНачала; 
	ДатаОкончания = Период.ДатаОкончания;
	ЕстьОтборПоЗданию = ЗначениеЗаполнено(Здание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ИсковоеЗаявление.Ссылка КАК Ссылка,
		|	бит_ИсковоеЗаявление.Услуга КАК Услуга,
		|	бит_ИсковоеЗаявление.Адрес КАК Адрес,
		|	бит_ИсковоеЗаявление.СуммаЗадолженности КАК СуммаЗадолженности,
		|	бит_ИсковоеЗаявление.Госпошлина КАК Госпошлина,
		|	бит_ИсковоеЗаявление.Здание КАК Здание,
		|	бит_ИсковоеЗаявление.Здание.Участок.Владелец.Наименование КАК ЗданиеУчастокВладелец,
        // KAN +++
		|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
		|	бит_ИсковоеЗаявление.Квартира КАК Квартира,
        // KAN ---
		|	бит_ИсковоеЗаявление.ПредставительскиеРасходы КАК ПредставительскиеРасходы,
		|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры
		|ПОМЕСТИТЬ ВТ_Доки
		|ИЗ
		|	Документ.бит_ИсковоеЗаявление КАК бит_ИсковоеЗаявление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_ИсковоеЗаявление.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|ГДЕ
		|	бит_ИсковоеЗаявление.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И бит_ИсковоеЗаявление.Проведен
		|	И бит_ИсковоеЗаявление.Услуга В(&Услуга)
		|	И ВЫБОР Когда &ЕстьОтборПоЗданию 
		|			Тогда бит_ИсковоеЗаявление.Здание = &Здание
		|			Иначе Истина
		|		Конец
		|	И ВЫБОР
		|			КОГДА &Отбор = 1
		|				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.НежилоеПомещение)
		|			КОГДА &Отбор = 2
		|				ТОГДА бит_СведенияОКвартиреСрезПоследних.ТипКвартиры = ЗНАЧЕНИЕ(Справочник.бит_ТипыКвартиры.Отдельная)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_ИсковоеЗаявлениеОтветчики.Ссылка КАК Ссылка,
		|	бит_ИсковоеЗаявлениеОтветчики.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТ_Ответчики
		|ИЗ
		|	Документ.бит_ИсковоеЗаявление.Ответчики КАК бит_ИсковоеЗаявлениеОтветчики
		|ГДЕ
		|	бит_ИсковоеЗаявлениеОтветчики.Ссылка В
		|			(ВЫБРАТЬ
		|				Вт_Доки.Ссылка КАК изВТ_Доки
		|			ИЗ
		|				Вт_Доки)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.ОсновнойБанковскийСчет.НомерСчета КАК РС_ЛВБ,
		|	Организации.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк_ЛВБ,
		|	Организации.ОсновнойБанковскийСчет.Банк.Код КАК БИК_ЛВБ,
		|	Организации.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет_ЛВБ
		|ПОМЕСТИТЬ ВТ_Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИНН = ""5503245214""
		|	И Организации.КПП = ""550301001""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	ОрганизацииКонтактнаяИнформация.Вид КАК Вид,
		|	ОрганизацииКонтактнаяИнформация.Представление КАК Адрес_ЛВБ
		|ПОМЕСТИТЬ ВТ_АдресЛВБ
		|ИЗ
		|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|ГДЕ
		|	ОрганизацииКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Организация.Ссылка
		|			ИЗ
		|				ВТ_Организация)
		|	И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо.ФИО КАК Контакт_ЛВБ,
		|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность.Наименование КАК Должность_ЛВБ
		|ПОМЕСТИТЬ ВТ_ОтветЛицаЛВБ
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
		|			&ДатаОкончания,
		|			СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						Вт_Организация.Ссылка
		|					ИЗ
		|						Вт_Организация)
		|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК РС_КомСети,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Наименование КАК Банк_КомСети,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БИК_КомСети,
		|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК КоррСчет_КомСети,
		|	Контрагенты.ОсновноеКонтактноеЛицо.Наименование КАК Контакт_КомСети,
		|	Контрагенты.ОсновноеКонтактноеЛицо.Должность КАК Должность_КомСети
		|ПОМЕСТИТЬ ВТ_Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = ""5503105129""
		|	И Контрагенты.КПП = ""550301001""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтрагентыКонтактнаяИнформация.Вид КАК Вид,
		|	КонтрагентыКонтактнаяИнформация.Представление КАК Адрес_КомСети
		|ПОМЕСТИТЬ ВТ_АдресКонтрагент
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				Вт_Контрагент.Ссылка
		|			ИЗ
		|				Вт_Контрагент)
		|	И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Доки.Ссылка КАК Ссылка,
		|	ВТ_Доки.Услуга КАК Услуга,
		|	ВТ_Доки.ЗданиеУчастокВладелец КАК Участок,
		|	ВТ_Доки.Адрес КАК АдресДолжника,
        // KAN +++
		|	ВТ_Доки.Здание КАК Здание,
		|	ВТ_Доки.Квартира.бит_НомерКвартирыДляСортировки КАК Квартира,
		|	ВТ_Доки.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры,
		| 	ВТ_Доки.Здание.Улица.Наименование КАК ЗданиеУлицаНаименование,
		|	ВТ_Доки.Здание.НомерДома КАК ЗданиеНомерДома,
       // KAN ---
		|	ВТ_Доки.СуммаЗадолженности КАК СуммаЗадолженности,
		|	ВТ_Доки.Госпошлина КАК Госпошлина,
		|	ВТ_Доки.ПредставительскиеРасходы КАК ПредставительскиеРасходы
		|ИЗ
		|	ВТ_Доки КАК ВТ_Доки
		|
        // KAN +++
		|УПОРЯДОЧИТЬ ПО
		|	ЗданиеУлицаНаименование,
		|	ЗданиеНомерДома,
		|	Здание,
		|	Квартира
        // KAN ---
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Ответчики.Ссылка КАК Ссылка,
		|	ВТ_Ответчики.ФизЛицо КАК ФИОДолжника,
		|	ВЫБОР
		|		КОГДА ФИОФизическихЛицСрезПоследних.Фамилия ЕСТЬ NULL
		|			ТОГДА ВТ_Ответчики.ФизЛицо
		|		ИНАЧЕ ФИОФизическихЛицСрезПоследних.Фамилия + "" "" + ФИОФизическихЛицСрезПоследних.Имя + "" "" + ФИОФизическихЛицСрезПоследних.Отчество
		|	КОНЕЦ КАК ФИО
		|ИЗ
		|	ВТ_Ответчики КАК ВТ_Ответчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(
		|				&ДатаОкончания,
		|				ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						ВТ_Ответчики.ФизЛицо
		|					ИЗ
		|						ВТ_Ответчики)) КАК ФИОФизическихЛицСрезПоследних
		|		ПО ВТ_Ответчики.ФизЛицо = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Организация.Ссылка КАК Ссылка,
		|	ВТ_Организация.РС_ЛВБ КАК РС_ЛВБ,
		|	ВТ_Организация.Банк_ЛВБ КАК Банк_ЛВБ,
		|	ВТ_Организация.БИК_ЛВБ КАК БИК_ЛВБ,
		|	ВТ_Организация.КоррСчет_ЛВБ КАК КоррСчет_ЛВБ,
		|	ВТ_АдресЛВБ.Адрес_ЛВБ КАК АдресДолжника,
		|	ВТ_ОтветЛицаЛВБ.Контакт_ЛВБ КАК Контакт_ЛВБ,
		|	ВТ_ОтветЛицаЛВБ.Должность_ЛВБ КАК Должность_ЛВБ
		|ИЗ
		|	ВТ_Организация КАК ВТ_Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АдресЛВБ КАК ВТ_АдресЛВБ
		|		ПО ВТ_Организация.Ссылка = ВТ_АдресЛВБ.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтветЛицаЛВБ КАК ВТ_ОтветЛицаЛВБ
		|		ПО ВТ_Организация.Ссылка = ВТ_ОтветЛицаЛВБ.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Контрагент.Ссылка КАК Ссылка,
		|	ВТ_Контрагент.РС_КомСети КАК РС_КомСети,
		|	ВТ_Контрагент.Банк_КомСети КАК Банк_КомСети,
		|	ВТ_Контрагент.БИК_КомСети КАК БИК_КомСети,
		|	ВТ_Контрагент.КоррСчет_КомСети КАК КоррСчет_КомСети,
		|	ВТ_Контрагент.Контакт_КомСети КАК Контакт_КомСети,
		|	ВТ_Контрагент.Должность_КомСети КАК Должность_КомСети,
		|	ВТ_АдресКонтрагент.Адрес_КомСети КАК Адрес_КомСети
		|ИЗ
		|	ВТ_Контрагент КАК ВТ_Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АдресКонтрагент КАК ВТ_АдресКонтрагент
		|		ПО ВТ_Контрагент.Ссылка = ВТ_АдресКонтрагент.Ссылка";
	                                            	
	Запрос.УстановитьПараметр("ДатаНачала"			, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"		, ДатаОкончания);
	Запрос.УстановитьПараметр("Услуга"				, Услуга); 
	Запрос.УстановитьПараметр("Отбор"           	, Отбор);   
	//Melnik 15601
	Запрос.УстановитьПараметр("ЕстьОтборПоЗданию"	, ЕстьОтборПоЗданию); 
	Запрос.УстановитьПараметр("Здание"           	, Здание);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументы = МассивРезультатов[7].Выбрать();
	ТЗ_Ответчики = МассивРезультатов[8].Выгрузить();
	
	НомерСтроки = 1;
	СтруктураОтбора = Новый Структура("Ссылка");
	
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ФИО = "";
		НоваяСтрока = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока ,ВыборкаДокументы);
		НоваяСтрока.Ном = НомерСтроки;
		
        // KAN +++
		СтруктураПоиска = Новый Структура("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПочтовыйАдресЗдания"));
		
		Строки = ВыборкаДокументы.Здание.КонтактнаяИнформация.НайтиСтроки(СтруктураПоиска);
		
		Если Строки.количество() = 0 и ЗначениеЗаполнено(ВыборкаДокументы.Здание.ПочтовыйАдрес) И ЗначениеЗаполнено(ВыборкаДокументы.лб_ПредставлениеКвартиры) Тогда
			
			Адрес = ВыборкаДокументы.Здание.ПочтовыйАдрес + " кв." + Строка(ВыборкаДокументы.лб_ПредставлениеКвартиры);
			
		ИначеЕсли НЕ Строки.количество() = 0 И ЗначениеЗаполнено(ВыборкаДокументы.лб_ПредставлениеКвартиры) Тогда	
			
			Адрес = Строки[0].Представление + " кв." + Строка(ВыборкаДокументы.лб_ПредставлениеКвартиры);
		
		Иначе
			
			Адрес = ВыборкаДокументы.Адрес;
			
		КонецЕсли;		
		НоваяСтрока.АдресДолжника = Адрес;
        // KAN ---
		
		
		СтруктураОтбора.Ссылка = ВыборкаДокументы.Ссылка;
		мОтветчики = ТЗ_Ответчики.НайтиСтроки(СтруктураОтбора);
		
		Если мОтветчики.Количество() Тогда
			
			Для Каждого СтрМ Из мОтветчики Цикл
				ФИО = ФИО + СтрМ.ФИО + "," + Символы.ПС ;
			КонецЦикла;
			
		КонецЕсли;
		
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ФИО, 2);
				
		НоваяСтрока.ФИОДолжника = ФИО;
		
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
